<template>
    <my-page title="帮助文档">
        <ui-article class="article">
            <h2>功能介绍</h2>
            <p>Yunser Draw 是一款基于浏览器的图像编辑工具，可用于简单的涂鸦和图片编辑。</p>
            <p>本软件具有如下功能：</p>
            <ul>
                <li>支持铅笔和蜡笔两种画笔。</li>
                <li>支持模糊、浮雕、灰度等 7 种滤镜。</li>
                <li>支持直线、圆和矩形的绘制。</li>
                <li>支持钢笔工具。</li>
                <li>支持两个图层</li>
                <li>支持过程回放（钢笔工具暂不支持回放）</li>
                <li>其他等工具。</li>
            </ul>

            <h2>使用帮助</h2>

            <h3>上传图片</h3>
            <p>如果想上传本地图片进行编辑，有两种方式：</p>
            <p>1. 直接将图片拖拽到画板。</p>
            <p>2. 点击菜单【关联其他应用】，选择【上传本地图片】。也可以选择其他应用获取图片。</p>

            <h3>常用功能</h3>
            <p>选择画笔或橡皮檫工具时，在画布上右键可以进行相关设置。</p>
            <p>钢笔工具用来绘制曲线</p>
            <p>使用铅笔工具或橡皮檫工具时，可以通过鼠标滚轮调整大小，右键可以进行设置。</p>

            <h3>工具栏工具介绍</h3>
            <ul>
                <li>移动图像：对整体图片进行移动操作，超出画布的部分将被剪裁。</li>
                <li>文字：添加文字。</li>
                <li>橡皮檫：用来擦除图片的一部分。使用橡皮檫工具时，可通过鼠标滚轮来设置橡皮檫的大小。</li>
                <li>魔术橡皮檫：智能橡皮檫，可以擦去附件相同颜色的区域。</li>
                <li>取色：点击画布任意位置进行取色。</li>
            </ul>
            <h4>画笔工具</h4>
            <ul>
                <li>铅笔：常用的画笔工具，支持设置大小和透明度。</li>
                <li>蜡笔：支持蜡笔效果。</li>
                <li>柳叶笔：用于快速绘制。</li>
                <li>颜料桶：用于快速填充颜色或快速替换颜色。配合形状工具效果更佳。</li>
            </ul>

            <h4>形状工具</h4>
            <p>所有的形状工具都支持设置线条粗细和颜色（在右边设置）。</p>
            <ul>
                <li>直线：绘制直线。</li>
                <li>圆：绘制圆形。</li>
                <li>矩形：绘制矩形。</li>
                <li>椭圆：绘制椭圆。</li>
                <li>箭头：绘制箭头。</li>
                <li>钢笔：绘制曲线。</li>
            </ul>

            <h4>剪裁工具</h4>
            <ul>
                <li>剪裁：剪裁工具，在画布上鼠标右键菜单可以进行【剪裁】或者【取消】。</li>
                <li>区域剪裁：绘制一个形状，对形状进行剪裁。</li>
            </ul>

            <h2>快捷键</h2>
            <p>Ctrl + S：保存</p>
            <p>Ctrl + Y：重做</p>
            <p>Ctrl + Z：撤销</p>

            <h2>浏览器要求</h2>
            <p>尽可能使用最新的浏览器</p>

            <h2>版本介绍</h2>
            <p>当前版本为v1.2。</p>
            <p>目前支持的功能有：</p>
            <ul>
                <li>支持铅笔和蜡笔两种画笔。</li>
                <li>支持模糊、浮雕、灰度等 7 种滤镜。</li>
                <li>支持直线、圆和矩形的绘制。</li>
                <li>支持钢笔工具。</li>
            </ul>

            <h2>其他</h2>
            <p>遇到任何 bug，比如不能编辑了，不能设置了，请保存后刷新页面，一般都能解决问题~</p>
        </ui-article>
    </my-page>
</template>

<script>
    export default {
        data () {
            return {
            }
        }
    }
</script>

<style lang="scss" scoped>
    .article {
        width: 800px;
        margin: 0 auto;
        h4 {
            font-weight: bold;
        }
    }

</style>
